<?php
declare(strict_types=1);

namespace Database\Seeders;

use App\Models\EventModel;
use Carbon\Carbon;
use Illuminate\Database\Seeder;

class EventSeeder extends Seeder
{
    private int $citiesCount = 5;
    private int $eventTypesCount = 3;
    private array $eventNames = [
        1 => [
            'Сплеск Емоцій',
            'Музична Одіссея',
            'Лунатичний Ритм',
            'Вібрація Душі',
            'Сонячний Акустик',
            'Вогняна Мелодія',
            'Хвилі Хороводу',
            'Гармонія Світу',
            'Експресія Звуку',
            'Рокова Енергія',
            'Меланхолійний Шепіт',
            'Джазові Ноти',
            'Електрична Фантазія',
            'Відплив Світла',
            'Лірична Ейфорія',
            'Симфонія Вітру',
            'Блюзова Мрія',
            'Гіпнотичний Грув',
            'Рок-н-Рол Імпульс',
            'Магія Мелодії',
            'Сентиментальна Симфонія'
        ],
        2 => [
            'Ковальчук Олександр',
            'Петренко Вікторія',
            'Іванова Марія',
            'Сидоренко Василь',
            'Павленко Людмила',
            'Савченко Олена',
            'Мельник Андрій',
            'Коваль Марина',
            'Полякова Ірина',
            'Лисенко Сергій',
            'Бойко Наталія',
            'Марченко Дмитро',
            'Григоренко Тетяна',
            'Михайленко Олег',
            'Кузьменко Анна',
            'Ткаченко Ігор',
            'Сергієнко Ольга',
            'Шевченко Артем',
            'Кононова Віра',
            'Мазур Іван',
        ],
        3 => [
            'Казковий музичний світ',
            'Співаймо разом з мультгероями',
            'Магія музики та веселощів',
            'Концерт "Смішинки та пісня"',
            'Танцювальна феєрія для малюків',
            'Джазові пригоди у країні фантазії',
            'Рок-н-рольний карнавал для дітей',
            'Концерт "Дитячі мрії на сцені"',
            'Музичний вечір з казковими героями',
            'Виступ аніматорів та музичних героїв',
            'Дитячий хіт-парад улюблених пісень',
            'Концерт "Сонячні промінчики музики"',
            'Мюзикл "Пригоди доброго піратського корабля"',
            'Дитячі хорові свята та концерти',
            'Музичний шоу "Джунглі у ритмі мелодій"',
            'Вечірка з аніматорами та музичними виступами',
            'Концерт "Зіркова ніч дитячої музики"',
            'Дитячий музичний фестиваль "Веселі нотки"',
            'Магічний виступ фокусників та музикантів',
            'Тематичний концерт "Подорож у казкову країну"',
        ],
    ];
    private Carbon $now;

    public function run(): void
    {
        $this->now = Carbon::now();

        $events = [];

        $eventsToSeed = $this->eventTypesCount * $this->citiesCount * 2;

        for ($i = 1; $i <= $eventsToSeed; $i++) {
            $events[] = $this->geteventData($i);
        }

        EventModel::query()->upsert($events, ['id']);
    }

    private function geteventData(int $id): array
    {
        $eventTypeId = ($id % $this->eventTypesCount) + 1;
        $cityId = ($id % $this->citiesCount) + 1;
        $nameOrder = $id / $this->eventTypesCount;
        $daysAhead = (int) (($id / 10) + 1) * 10; // 10, 20, 30...

        return [
            'id' => $id,
            'event_type_id' => $eventTypeId,
            'city_id' => $cityId,
            'name' => $this->eventNames[$eventTypeId][$nameOrder],
            'date' => $this->now->copy()->addDays($daysAhead),
            'image' => 'test.jpg',
            'description' => fake()->text(1500),
            'notes' => fake()->text(700),
        ];
    }
}
